-- ------------------------------------------------------------------------------------------------
-- ---------- 创建物品 ----------------------------------------------------------------------------
-- ------------------------------------------------------------------------------------------------

SIGen
.NewItem( "icon-empty" , 1000 ).AddFlags( SIFlags.itemFlags.hidden )
.NewItem( "icon-edit" , 1000 ).AddFlags( SIFlags.itemFlags.hidden )
.NewItem( "icon-save" , 1000 ).AddFlags( SIFlags.itemFlags.hidden )