return
{
	base = "CoreFunctionLibrary" ,
	autoLoad = true ,
	autoName = true
	-- ------------------------------------------------------------------------------------------------
	-- [final_setting_datas] 是用来把 mod 设置的值替换成固定配置的值的 , 主要供服务器等特殊场合使用
	-- 这种方式仅对 SI 系列 mod 有效(当然也包括使用了完全一样的写法的 mod)
	-- ------------------------------------------------------------------------------------------------
	-- 具体格式为 :
	--     name1 = value1 ,
	--     name2 = value2
	--     ...
	-- 可用的 name 值详见同 mod 下 constants.lua 中的 [settings] 内的 key 部分
	-- 可用的 value 值依据实际设置类型而定 , 使用非法的值会炸掉游戏
	-- ------------------------------------------------------------------------------------------------
	-- 对于被替换的设置 , 游戏内设置则会完全变成摆设 , 不会起任何作用 , 实际引用的是这里配置的 value 值
	-- 这里只能替换同 mod 创建的 mod 设置的值 , 如果包含了其他的设置 , 则那个设置会被忽略
	-- ------------------------------------------------------------------------------------------------
	-- 栗子 :
	-- final_setting_datas =
	-- {
	--     writelog = true ,
	--     debug = true
	-- }
	-- ------------------------------------------------------------------------------------------------
}