SIColors =
{
	baseColor =
	{
		baseWhite = { 1.00 , 1.00 , 1.00 } , -- 纯白
		baseBlack = { 0.00 , 0.00 , 0.00 } , -- 纯黑
		
		yellow    = { 1.00 , 0.78 , 0.00 } , -- 黄
		white     = { 0.88 , 0.88 , 0.88 } , -- 白
		red       = { 0.82 , 0.00 , 0.00 } , -- 红
		green     = { 0.31 , 0.90 , 0.00 } , -- 绿
		clay      = { 0.12 , 0.88 , 0.78 } , -- 青
		blue      = { 0.12 , 0.27 , 0.86 } , -- 蓝
		pink      = { 0.94 , 0.35 , 0.67 } , -- 粉
		purple    = { 0.67 , 0.00 , 0.67 } , -- 紫
		orange    = { 0.94 , 0.55 , 0.00 } , -- 橙
		gray      = { 0.50 , 0.50 , 0.50 }   -- 灰
	} ,
	printColor =
	{
		white     = { r = 0.88 , g = 0.88 , b = 0.88 } , -- 白
		red       = { r = 1.00 , g = 0.40 , b = 0.40 } , -- 红
		green     = { r = 0.45 , g = 0.94 , b = 0.09 } , -- 绿
		blue      = { r = 0.28 , g = 0.64 , b = 0.96 } , -- 蓝
		yellow    = { r = 1.00 , g = 1.00 , b = 0.40 } , -- 黄
		orange    = { r = 1.00 , g = 0.70 , b = 0.40 }   -- 橙
	} ,
	damageBeamColor =
	{
		physical  = { r = 0.90 , g = 0.65 , b = 0.22 } ,
		impact    = { r = 0.50 , g = 0.50 , b = 0.50 } ,
		poison    = { r = 0.43 , g = 0.86 , b = 0.24 } ,
		explosion = { r = 0.90 , g = 0.06 , b = 0.65 } ,
		fire      = { r = 0.90 , g = 0.31 , b = 0.06 } ,
		laser     = { r = 0.92 , g = 0.16 , b = 0.16 } ,
		acid      = { r = 0.84 , g = 0.92 , b = 0.16 } ,
		electric  = { r = 0.06 , g = 0.41 , b = 0.90 } ,
		curse     = { r = 0.15 , g = 0.15 , b = 0.15 } ,
		other     = { r = 1.00 , g = 1.00 , b = 1.00 }
	} ,
	fontColor =
	{
		black     = { r = 1.00 , g = 1.00 , b = 1.00 }   -- 黑色
	} ,
	buttonColor =
	{
		default   = { r = 0.01 , g = 0.01 , b = 0.01 , a = 0.40 } , -- 默认颜色
		gray      = { r = 0.90 , g = 0.90 , b = 0.30 , a = 0.50 } , -- 灰色
		green     = { r = 0.35 , g = 1.00 , b = 0.35 , a = 0.50 } , -- 绿色
		red       = { r = 1.00 , g = 0.35 , b = 0.35 , a = 0.50 }   -- 红色
	}
}